&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПорядокИтогов.Загрузить(ПолучитьИзВременногоХранилища(Параметры.ПорядокИтогов));
КонецПроцедуры

&НаКлиенте
Процедура Готово(Команда)
	СтруктураПорядкаИтогов = Новый Структура;
	СтруктураПорядкаИтогов.Вставить("ПорядокИтогов", НастройкаПорядкаСерв());
	Закрыть(СтруктураПорядкаИтогов);
КонецПроцедуры

&НаСервере
Функция НастройкаПорядкаСерв()
	Возврат ПоместитьВоВременноеХранилище(ПорядокИтогов.Выгрузить());
КонецФункции

&НаКлиенте
Процедура ПорядокИтоговВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВверх(Команда)
	Если Элементы.ПорядокИтогов.ТекущиеДанные <> Неопределено и Элементы.ПорядокИтогов.ТекущаяСтрока > 0 Тогда 
		строкаВыше = ПорядокИтогов.Получить(Элементы.ПорядокИтогов.ТекущаяСтрока - 1);
		
		поле = строкаВыше.поле;
		использовать = строкаВыше.использовать;
		
		строкаВыше.поле = Элементы.ПорядокИтогов.ТекущиеДанные.поле;
		строкаВыше.использовать = Элементы.ПорядокИтогов.ТекущиеДанные.использовать;
		
		Элементы.ПорядокИтогов.ТекущиеДанные.поле = поле;
		Элементы.ПорядокИтогов.ТекущиеДанные.использовать = использовать;
		
		Элементы.ПорядокИтогов.ТекущаяСтрока = Элементы.ПорядокИтогов.ТекущаяСтрока - 1;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВниз(Команда)
	Если Элементы.ПорядокИтогов.ТекущиеДанные <> Неопределено и Элементы.ПорядокИтогов.ТекущаяСтрока < ПорядокИтогов.Количество() - 1 Тогда 
		строкаВыше = ПорядокИтогов.Получить(Элементы.ПорядокИтогов.ТекущаяСтрока + 1);
		
		поле = строкаВыше.поле;
		использовать = строкаВыше.использовать;
		
		строкаВыше.поле = Элементы.ПорядокИтогов.ТекущиеДанные.поле;
		строкаВыше.использовать = Элементы.ПорядокИтогов.ТекущиеДанные.использовать;
		
		Элементы.ПорядокИтогов.ТекущиеДанные.поле = поле;
		Элементы.ПорядокИтогов.ТекущиеДанные.использовать = использовать;
		
		Элементы.ПорядокИтогов.ТекущаяСтрока = Элементы.ПорядокИтогов.ТекущаяСтрока + 1;
	КонецЕсли;
КонецПроцедуры
