Функция ПолучитьПрофиль() Экспорт	
	ПочтовыйПрофиль = Новый ИнтернетПочтовыйПрофиль;
    
    ПочтовыйПрофиль.ПортSMTP     = 465;
    ПочтовыйПрофиль.POP3ПередSMTP = Ложь;
    ПочтовыйПрофиль.АдресСервераIMAP = "";
    ПочтовыйПрофиль.АдресСервераPOP3 = "";
    ПочтовыйПрофиль.АдресСервераSMTP = "smtp.gmail.com";
    ПочтовыйПрофиль.АутентификацияPOP3 = СпособPOP3Аутентификации.Обычная;
    ПочтовыйПрофиль.АутентификацияSMTP = СпособSMTPАутентификации.ПоУмолчанию;
    ПочтовыйПрофиль.ИспользоватьSSLIMAP = Ложь;
    ПочтовыйПрофиль.ИспользоватьSSLPOP3 = ложь;
    ПочтовыйПрофиль.ИспользоватьSSLSMTP = Истина;
    ПочтовыйПрофиль.Пароль = "";
    ПочтовыйПрофиль.ПарольIMAP = "";
    ПочтовыйПрофиль.ПарольSMTP = ЗначениеНастроекВызовСервераПовтИсп.ПолучитьЗначениеКонстанты("ПарольПочтыБекапа");
    ПочтовыйПрофиль.Пользователь = "";
    ПочтовыйПрофиль.ПользовательIMAP = "";
	
	адресПочты = ЗначениеНастроекВызовСервераПовтИсп.ПолучитьЗначениеКонстанты("АдресПочтыБекапа");
	
	Если не ЗначениеЗаполнено(адресПочты) Тогда 
		ВызватьИсключение НСтр("ru = 'Не указан адрес почты бекапа'");
	КонецЕсли;
	
	ПочтовыйПрофиль.ПользовательSMTP = адресПочты;
    ПочтовыйПрофиль.ПортIMAP = 0;
    ПочтовыйПрофиль.ПортPOP3 = 0;
    ПочтовыйПрофиль.Таймаут = 30;
    ПочтовыйПрофиль.ТолькоЗащищеннаяАутентификацияIMAP = Ложь;
    ПочтовыйПрофиль.ТолькоЗащищеннаяАутентификацияPOP3 = Ложь;
    ПочтовыйПрофиль.ТолькоЗащищеннаяАутентификацияSMTP = ложь; 
	
	Возврат ПочтовыйПрофиль;	
КонецФункции