#Область ПрограммныйИнтерфейс

Функция ПолучитьПрофиль(АдресПочтыРезервногоКопирования = Неопределено) Экспорт
	
	ПочтовыйПрофиль = Новый ИнтернетПочтовыйПрофиль;
	
	ПочтовыйПрофиль.ПортSMTP = 465;
	ПочтовыйПрофиль.POP3ПередSMTP = Ложь;
	ПочтовыйПрофиль.АдресСервераIMAP = "";
	ПочтовыйПрофиль.АдресСервераPOP3 = "";
	ПочтовыйПрофиль.АдресСервераSMTP = "smtp.gmail.com";
	//ПочтовыйПрофиль.АутентификацияPOP3 = СпособPOP3Аутентификации.Обычная;
	//ПочтовыйПрофиль.АутентификацияSMTP = СпособSMTPАутентификации.ПоУмолчанию;
	ПочтовыйПрофиль.ИспользоватьSSLIMAP = Ложь;
	ПочтовыйПрофиль.ИспользоватьSSLPOP3 = Ложь;
	ПочтовыйПрофиль.ИспользоватьSSLSMTP = Истина;
	ПочтовыйПрофиль.Пароль = "";
	ПочтовыйПрофиль.ПарольIMAP = "";
	ПочтовыйПрофиль.ПарольSMTP = ЗначениеНастроекВызовСервераПовтИсп.ПолучитьЗначениеКонстанты("ПарольПочтыРезервногоКопирования");
	ПочтовыйПрофиль.Пользователь = "";
	ПочтовыйПрофиль.ПользовательIMAP = "";
	
	Если АдресПочтыРезервногоКопирования = Неопределено Тогда 
		АдресПочтыРезервногоКопирования = ЗначениеНастроекВызовСервераПовтИсп.ПолучитьЗначениеКонстанты("АдресПочтыРезервногоКопирования");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(АдресПочтыРезервногоКопирования) Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	ПочтовыйПрофиль.ПользовательSMTP = АдресПочтыРезервногоКопирования;
	ПочтовыйПрофиль.ПортIMAP = 0;
	ПочтовыйПрофиль.ПортPOP3 = 0;
	ПочтовыйПрофиль.Таймаут = 30;
	ПочтовыйПрофиль.ТолькоЗащищеннаяАутентификацияIMAP = Ложь;
	ПочтовыйПрофиль.ТолькоЗащищеннаяАутентификацияPOP3 = Ложь;
	ПочтовыйПрофиль.ТолькоЗащищеннаяАутентификацияSMTP = Ложь; 
	
	Возврат ПочтовыйПрофиль;
	
КонецФункции

#КонецОбласти