
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	#Если МобильноеПриложениеСервер Тогда
		Разделитель = "/";
	#Иначе
		
		Разделитель = "\";    
	#КонецЕсли
	
	Если не Параметры.Свойство("каталог", Каталог) Тогда 
		Каталог = Константы.КаталогХраненияФайлов.Получить();
	КонецЕсли;
	
	Если не Параметры.Свойство("формат", форматФайла) Тогда 
		форматФайла = "*.xml";
	КонецЕсли;
	
	Заголовок = Заголовок + " " + форматФайла;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьСписокПоКаталогу();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОбновитьСписокПоКаталогу()
КонецПроцедуры

&НаКлиенте
Процедура КаталогПриИзменении(Элемент)
	ОбновитьСписокПоКаталогу();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаФайловВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Элементы.ТаблицаФайлов.ТекущиеДанные <> Неопределено Тогда 
		Закрыть(Элементы.ТаблицаФайлов.ТекущиеДанные.ПолноеИмяФайла);
	Иначе
		Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КаталогНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбор(Команда)
	Если Элементы.ТаблицаФайлов.ТекущиеДанные <> Неопределено Тогда 
		Закрыть(Элементы.ТаблицаФайлов.ТекущиеДанные.ПолноеИмяФайла);
	Иначе
		Закрыть();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

