#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДинамикаОстатковПоКошелькам(Команда)
	ОткрытьФорму("Обработка.Отчеты.Форма.ДинамикаОстатковПоКошелькам");
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ОтчетПоРасходам(Команда)
	ОткрытьФорму("Обработка.Отчеты.Форма.ОтчетПоРасходам");
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ОтчетСравнениеПоСтатьям(Команда)
	ОткрытьФорму("Обработка.Отчеты.Форма.СравнениеПоСтатьям");
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПартииВалют(Команда)
	ОткрытьФорму("Обработка.Отчеты.Форма.ОстаткиПартийВалют");
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПродажиПартийВалют(Команда)
	ОткрытьФорму("Обработка.Отчеты.Форма.ПродажиПартийВалют");
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ОтчетПоРасходамОбщие(Команда)
	ОткрытьФорму("Обработка.Отчеты.Форма.ОтчетПоРасходам", Новый Структура("ОбщиеРасходы"));
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ОтчетСравнениеПериодов(Команда)
	ОткрытьФорму("Обработка.Отчеты.Форма.СравнениеПериодов");
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаДолгиЗатраты(Команда)
	ОткрытьФорму("Обработка.Отчеты.Форма.ПроверкаДолгиЗатраты");
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ТекущиеОстатки(Команда)
	ОткрытьФорму("Обработка.Отчеты.Форма.ТекущиеОстатки");
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ОтчетПоДолгам(Команда)
	ОткрытьФорму("Обработка.Отчеты.Форма.ОтчетПоДолгам");
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ОтчетПоПереводам(Команда)
	ОткрытьФорму("Обработка.Отчеты.Форма.ОтчетПоПереводам");
	Закрыть();
КонецПроцедуры

#КонецОбласти