#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	
	Валюта1 = Параметры.Валюта1;
	Валюта2 = Параметры.Валюта2;
	
	Если Параметры.Свойство("Курс") Тогда 
		Если Параметры.Курс <> 0 Тогда 
			Курс = Параметры.Курс;
		КонецЕсли;		
	КонецЕсли;
	
	Если Параметры.КурсПрямой Тогда 
		Элементы.Группа1.ТекущаяСтраница = Элементы.ГруппаКурсПрямой;
	Иначе
		Элементы.Группа1.ТекущаяСтраница = Элементы.ГруппаКурсОбратный;
	КонецЕсли;
	
	Элементы.Декорация1.Заголовок = "1 " + Валюта1.КраткоеНаименование + " = ";
	Элементы.Декорация2.Заголовок = "1 " + Валюта2.КраткоеНаименование + " = ";
	Элементы.Декорация3.Заголовок = Валюта2.КраткоеНаименование;
	Элементы.Декорация4.Заголовок = Валюта1.КраткоеНаименование;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	СтруктураВозврата = новый Структура();
	
	Если Элементы.Группа1.ТекущаяСтраница <> Элементы.ГруппаКурсПрямой Тогда 
		СтруктураВозврата.Вставить("Курс", Курс);
		СтруктураВозврата.Вставить("КурсПрямой", Ложь);
	Иначе
		СтруктураВозврата.Вставить("Курс", Курс);
		СтруктураВозврата.Вставить("КурсПрямой", Истина);
	КонецЕсли;
	
	ЭтаФорма.Закрыть(СтруктураВозврата);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура Группа1ПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Курс = ?(Курс = 0, 1, 1 / Курс);
	
	Если Курс > 1 Тогда 
		Курс = Курс;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
