
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДоступныеПоля.ЗагрузитьЗначения(ПолучитьИзВременногоХранилища(Параметры.АдресДоступныхПолей));	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДоступныеПоляВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Закрыть(ДоступныеПоля.Получить(ВыбраннаяСтрока).Значение);
	
КонецПроцедуры

#КонецОбласти