
&НаКлиенте
Процедура ИспользоватьРезервноеКопированиеНаПочтуПриИзменении(Элемент)
	УстановитьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступность()
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСоединениеСПочтой(Команда)
	Если Не ЗначениеЗаполнено(НаборКонстант.АдресПочтыРезервногоКопирования) Тогда 
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не задан адрес почты резервного копирования'"), "АдресПочтыРезервногоКопирования");
		
		Возврат;
	КонецЕсли;
	
	ПочтовыйПрофиль = РаботаСПочтойКлиентСервер.ПолучитьПрофиль(НаборКонстант.АдресПочтыРезервногоКопирования);
	ПочтовыйПрофиль.ПарольSMTP = НаборКонстант.ПарольПочтыРезервногоКопирования;
	
	Почта = Новый ИнтернетПочта;
	
	Попытка
		Почта.Подключиться(ПочтовыйПрофиль);
	Исключение
		ОбщегоНазначенияКлиент.СообщитьПользователю(ОписаниеОшибки());
		
		Возврат;
	КонецПопытки;
	
	ПоказатьПредупреждение(, НСтр("ru = 'Подключение успешно установлено'"));
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ОбновитьПовторноИспользуемыеЗначения();
	
	СтандартныеПодсистемыКлиент.ПараметрыРаботыКлиентаПриЗапуске();
КонецПроцедуры
