
&НаКлиенте
Процедура ИспользоватьБекапНаПочтуПриИзменении(Элемент)
	УстановитьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступность()
	//Элементы.АдресПочтыБекапа.ТолькоПросмотр = не НаборКонстант.ИспользоватьБекапНаПочту;
	//Элементы.ПарольПочтыБекапа.ТолькоПросмотр = не НаборКонстант.ИспользоватьБекапНаПочту;
	//Элементы.ДатаПоследнегоБекапа.ТолькоПросмотр = не НаборКонстант.ИспользоватьБекапНаПочту;
	//Элементы.ПериодичностьБекапа.ТолькоПросмотр = не НаборКонстант.ИспользоватьБекапНаПочту;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСоединениеСПочтой(Команда)
	Если не ЗначениеЗаполнено(НаборКонстант.АдресПочтыБекапа) Тогда 
		сообщ = новый СообщениеПользователю;
		сообщ.Текст = НСтр("ru = 'Не задан адрес почты бекапа'");
		сообщ.Поле = "АдресПочтыБекапа";
		сообщ.УстановитьДанные(ЭтаФорма);
		сообщ.Сообщить();
		
		Возврат;
	КонецЕсли;
	
	ПочтовыйПрофиль = Новый ИнтернетПочтовыйПрофиль;
    
    ПочтовыйПрофиль.ПортSMTP     = 465;
    ПочтовыйПрофиль.POP3ПередSMTP = Ложь;
    ПочтовыйПрофиль.АдресСервераIMAP = "";
    ПочтовыйПрофиль.АдресСервераPOP3 = "";
    ПочтовыйПрофиль.АдресСервераSMTP = "smtp.gmail.com";
    ПочтовыйПрофиль.АутентификацияPOP3 = СпособPOP3Аутентификации.Обычная;
    ПочтовыйПрофиль.АутентификацияSMTP = СпособSMTPАутентификации.ПоУмолчанию;
    ПочтовыйПрофиль.ИспользоватьSSLIMAP = Ложь;
    ПочтовыйПрофиль.ИспользоватьSSLPOP3 = ложь;
    ПочтовыйПрофиль.ИспользоватьSSLSMTP = Истина;
    ПочтовыйПрофиль.Пароль = "";
    ПочтовыйПрофиль.ПарольIMAP = "";
    ПочтовыйПрофиль.ПарольSMTP = НаборКонстант.ПарольПочтыБекапа;
    ПочтовыйПрофиль.Пользователь = "";
    ПочтовыйПрофиль.ПользовательIMAP = "";
    ПочтовыйПрофиль.ПользовательSMTP = НаборКонстант.АдресПочтыБекапа;
    ПочтовыйПрофиль.ПортIMAP = 0;
    ПочтовыйПрофиль.ПортPOP3 = 0;
    ПочтовыйПрофиль.Таймаут = 30;
    ПочтовыйПрофиль.ТолькоЗащищеннаяАутентификацияIMAP = Ложь;
    ПочтовыйПрофиль.ТолькоЗащищеннаяАутентификацияPOP3 = Ложь;
    ПочтовыйПрофиль.ТолькоЗащищеннаяАутентификацияSMTP = ложь;
	
	Почта = Новый ИнтернетПочта;
	
	Попытка		
		Почта.Подключиться(ПочтовыйПрофиль);
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		
		Возврат;
	КонецПопытки;
	
	ПоказатьПредупреждение(, НСтр("ru = 'Подключение успешно установлено'"));
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ОбновитьПовторноИспользуемыеЗначения();
	
	СтандартныеПодсистемыКлиент.ПараметрыРаботыКлиентаПриЗапуске();
КонецПроцедуры
