&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	текстОшибки = "";
	
	ОбработкаКомандыСервер(текстОшибки);
	
	Сообщить(текстОшибки);
КонецПроцедуры

&НаСервере
Процедура ОбработкаКомандыСервер(текстОшибки)
	Попытка
		Адрес = "http://localhost/MyTerp/ws/wsContinentPersons.1cws?wsdl";
		Определения = Новый WSОпределения(Адрес, "Admin", "111");
		
		Прокси = Новый WSПрокси(Определения, "http://localhost/wsContinentPersons", "ContinentPersons_сбз", "ContinentPersons_сбзSoap");
		
		СисИнфо = Новый СистемнаяИнформация;
		КодМобильногоКомпьютера = Строка(СисИнфо.ИдентификаторКлиента);
		//
		////1. Инициализация (Если нужно)
		//Узел = ПланыОбмена.Мобильные.ЭтотУзел();
		//Если НЕ ЗначениеЗаполнено(Узел.Код)
		//	ИЛИ не (Узел.Код = КодМобильногоКомпьютера или Узел.Код = "Main") Тогда
		//	ОбъектУзла = Узел.ПолучитьОбъект();
		//	ОбъектУзла.Код = КодМобильногоКомпьютера;
		//	ОбъектУзла.Наименование = КодМобильногоКомпьютера;
		//	ОбъектУзла.Записать();
		//КонецЕсли;
		//
		//ЦентральныйУзелОбмена = ПланыОбмена.Мобильные.НайтиПоКоду("Main");
		//Если ЦентральныйУзелОбмена.Пустая() Тогда
		//	НовыйУзел = ПланыОбмена.Мобильные.СоздатьУзел();
		//	НовыйУзел.Код="Main";
		//	НовыйУзел.Наименование="Main";
		//	НовыйУзел.Записать();
		//	ЦентральныйУзелОбмена = НовыйУзел.Ссылка;
		//КонецЕсли;
		
		
		//2. Обмен с центральной базой
		//ДанныеОбмена = Прокси.ВыполнитьОбмен(КодМобильногоКомпьютера, СформироватьПакетОбмена(ЦентральныйУзелОбмена)); 
		
		ДанныеОбмена = Прокси.Exchange("1", "2");		
		
		сообщить(данныеОбмена);
		//3. Обработка данных, полученных из центральной базы
		//ЧтениеXML = Новый ЧтениеXML;
		//ЧтениеXML.УстановитьСтроку(ДанныеОбмена.Получить());
		//ЧтениеСообщения = ПланыОбмена.СоздатьЧтениеСообщения();
		//ЧтениеСообщения.НачатьЧтение(ЧтениеXML);
		//ПланыОбмена.УдалитьРегистрациюИзменений(ЧтениеСообщения.Отправитель,ЧтениеСообщения.НомерПринятого);
		//НачатьТранзакцию();
		//Пока ВозможностьЧтенияXML(ЧтениеXML) Цикл
		//	Данные = ПрочитатьXML(ЧтениеXML);
		//	Если НЕ Данные = Неопределено Тогда
		//		Данные.ОбменДанными.Отправитель = ЧтениеСообщения.Отправитель;
		//		Данные.ОбменДанными.Загрузка = Истина;
		//		Данные.Записать();
		//	КонецЕсли;
		//КонецЦикла;
		//ЗафиксироватьТранзакцию();
		//ЧтениеСообщения.ЗакончитьЧтение();
		//ЧтениеXML.Закрыть();	
	Исключение
		текстОшибки = ОписаниеОшибки();
		
		Возврат
	КонецПопытки;
	
	текстОшибки = "успех";
КонецПроцедуры

Функция СформироватьПакетОбмена(УзелОбмена) Экспорт
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку("UTF-8");
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	ЗаписьСообщения = ПланыОбмена.СоздатьЗаписьСообщения();
    ЗаписьСообщения.НачатьЗапись(ЗаписьXML, УзелОбмена);					
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsi", "http://www.w3.org/2001/XMLSchema-instance");
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("v8",  "http://v8.1c.ru/data");
	ВыборкаИзменений = ПланыОбмена.ВыбратьИзменения(УзелОбмена, ЗаписьСообщения.НомерСообщения);
	Пока ВыборкаИзменений.Следующий() Цикл
		Данные = ВыборкаИзменений.Получить();
	    ЗаписатьXML(ЗаписьXML, Данные);// Записываем данные в сообщение
    КонецЦикла;
	ЗаписьСообщения.ЗакончитьЗапись();
	Возврат Новый ХранилищеЗначения(ЗаписьXML.Закрыть(), Новый СжатиеДанных(9));
КонецФункции
