#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	Если Параметры.Свойство("КлючОбъекта") Тогда 
		КлючОбъекта = Параметры.КлючОбъекта;
		
		Элементы.КлючОбъекта.Видимость = Ложь;
	КонецЕсли;
	
	Список.Параметры.УстановитьЗначениеПараметра("КлючОбъекта", КлючОбъекта);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)	
	СтандартнаяОбработка = Ложь;
	
	Если Поле.Имя = "Основная" Тогда 
		ОсновнаяПриИзмененииНаСервере();
		
		Элементы.Список.Обновить();
	Иначе		
		ЭтаФорма.Закрыть(ВыбраннаяСтрока);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОсновнаяПриИзмененииНаСервере()
	Если Не Элементы.Список.ТекущаяСтрока.Основная Тогда		
		Об = Элементы.Список.ТекущаяСтрока.получитьОбъект();
		Об.Основная = Истина;
		Об.Записать();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти