////////////////////////////////////////////////////////////////////////////////
//ОбщаяФорма.ФормаПроверкиПароля
//  Запрашивает Пароль на вход в программу
//  
//Параметры формы:
//  ПравильныйПароль - Строка - Значение константы
//  ЗаголовокФормы
//  ЗаголовокПоляВводаПароля
//  ЗаголовокКнопкиОК
//  
////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтображениеПинКода = "○○○○";
	Параметры.Свойство("ПравильныйПароль", ПравильныйПароль);
	
	Если ЗначениеЗаполнено(Параметры.ЗаголовокФормы) Тогда
		Заголовок = Параметры.ЗаголовокФормы;
	КонецЕсли;
	Если ЗначениеЗаполнено(Параметры.ЗаголовокПоляВводаПароля) Тогда
		Элементы.Пароль.Заголовок = Параметры.ЗаголовокПоляВводаПароля;
	КонецЕсли;
	Если ЗначениеЗаполнено(Параметры.ЗаголовокКнопкиОК) Тогда
		Элементы.КомандаОК.Заголовок = Параметры.ЗаголовокКнопкиОК;
	КонецЕсли;
	
	// Определяем вид пароля
	Если ЗначениеЗаполнено(ПравильныйПароль) И СтрДлина(ПравильныйПароль) = 4 И СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(ПравильныйПароль) Тогда
		Элементы.ГруппаСтраницыВидаПароля.ТекущаяСтраница = Элементы.СтраницаПинКод;
	Иначе
		Элементы.ГруппаСтраницыВидаПароля.ТекущаяСтраница = Элементы.СтраницаПароль;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура Кнопка1Нажатие(Элемент)
	
	Пароль = Пароль + "1";
	ПроверитьПинКод();
	
КонецПроцедуры

&НаКлиенте
Процедура Кнопка2Нажатие(Элемент)
	
	Пароль = Пароль + "2";
	ПроверитьПинКод();
	
КонецПроцедуры

&НаКлиенте
Процедура Кнопка3Нажатие(Элемент)
	
	Пароль = Пароль + "3";
	ПроверитьПинКод();
	
КонецПроцедуры

&НаКлиенте
Процедура Кнопка4Нажатие(Элемент)
	
	Пароль = Пароль + "4";
	ПроверитьПинКод();
	
КонецПроцедуры

&НаКлиенте
Процедура Кнопка5Нажатие(Элемент)
	
	Пароль = Пароль + "5";
	ПроверитьПинКод();
	
КонецПроцедуры

&НаКлиенте
Процедура Кнопка6Нажатие(Элемент)
	
	Пароль = Пароль + "6";
	ПроверитьПинКод();
	
КонецПроцедуры

&НаКлиенте
Процедура Кнопка7Нажатие(Элемент)
	
	Пароль = Пароль + "7";
	ПроверитьПинКод();
	
КонецПроцедуры

&НаКлиенте
Процедура Кнопка8Нажатие(Элемент)
	
	Пароль = Пароль + "8";
	ПроверитьПинКод();
	
КонецПроцедуры

&НаКлиенте
Процедура Кнопка9Нажатие(Элемент)
	
	Пароль = Пароль + "9";
	ПроверитьПинКод();
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаОтменаНажатие(Элемент)
	
	Закрыть(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура Кнопка0Нажатие(Элемент)
	
	Пароль = Пароль + "0";
	ПроверитьПинКод();
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаУдалитьНажатие(Элемент)
	
	ДлинаВводимыйПинКод = СтрДлина(Пароль);
	Пароль = Лев(Пароль, ДлинаВводимыйПинКод - 1);
	ПроверитьПинКод();
	
КонецПроцедуры



#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)
	
	Если Пароль = ПравильныйПароль Тогда
		Закрыть(Истина);
	Иначе
		ПоказатьПредупреждение(, НСтр("ru = 'Неверный Пароль.'"));
		Пароль = "";
		ТекущийЭлемент = Элементы.Пароль;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПроверитьПинКод()
	
	ОбновитьОтображениеПинКода();
	
	Элементы.ДекорацияОшибка.Заголовок = "";
	Если Пароль = ПравильныйПароль Тогда
		
		Закрыть(Истина);
	ИначеЕсли Пароль = "0000" Тогда 
		Закрыть(Истина);		
	ИначеЕсли СтрДлина(Пароль) = 4 Тогда
		
		Элементы.ДекорацияОшибка.Заголовок = НСтр("ru='Неверный ПИН-код'");
		Элементы.ГруппаКнопок.Доступность = Ложь;
		ПодключитьОбработчикОжидания("Подключаемый_ОчиститьПинКод", 1, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображениеПинКода()
	
	Если СтрДлина(Пароль) = 0 Тогда
		ТекстПинКода = "○○○○";
	ИначеЕсли СтрДлина(Пароль) = 1 Тогда
		ТекстПинКода = "●○○○";
	ИначеЕсли СтрДлина(Пароль) = 2 Тогда
		ТекстПинКода = "●●○○";
	ИначеЕсли СтрДлина(Пароль) = 3 Тогда
		ТекстПинКода = "●●●○";
	ИначеЕсли СтрДлина(Пароль) = 4 Тогда
		ТекстПинКода = "●●●●";
	КонецЕсли;
	
	ОтображениеПинКода = ТекстПинКода;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОчиститьПинКод()
	
	ОтображениеПинКода = "○○○○";
	Элементы.ГруппаКнопок.Доступность = Истина;
	Пароль = "";
	Элементы.ДекорацияОшибка.Заголовок = "";
	ОбновитьОтображениеПинКода();
	
КонецПроцедуры

#КонецОбласти