
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.Декорация1.Заголовок = параметры.текст;
	ЭтаФорма.Заголовок = параметры.заголовокФормы;
	
	БольшеНеПоказыватьЧто = параметры.БольшеНеПоказыватьЧто;
КонецПроцедуры

&НаСервере
Процедура ПередЗакрытиемНаСервере()
	Если БольшеНеПоказывать Тогда 
		Если БольшеНеПоказыватьЧто = "БольшеНеПоказыватьУстановкуПароля" Тогда 
			Константы.НеПоказыватьСообщениеУстановкиПароля.Установить(Истина);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Готово(Команда)
	ПередЗакрытиемНаСервере();
	
	ЭтаФорма.Закрыть();
КонецПроцедуры
