
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.Декорация1.Заголовок = Параметры.Текст;
	Заголовок = Параметры.ЗаголовокФормы;
	
	БольшеНеПоказыватьЧто = Параметры.БольшеНеПоказыватьЧто;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Готово(Команда)
	ПередЗакрытиемНаСервере();
	
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПередЗакрытиемНаСервере()
	Если БольшеНеПоказывать Тогда 
		Если БольшеНеПоказыватьЧто = "БольшеНеПоказыватьУстановкуПароля" Тогда 
			Константы.НеПоказыватьСообщениеУстановкиПароля.Установить(Истина);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
