#Область ОписаниеПеременных

Перем ПараметрыПриложения Экспорт;

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередНачаломРаботыСистемы(Отказ)
	
	ОбщегоНазначенияКлиент.ПередНачаломРаботыСистемы(Отказ);
	
	СтандартныеПодсистемыКлиент.ПередНачаломРаботыСистемы();
	
КонецПроцедуры

Процедура ПередЗавершениемРаботыСистемы(Отказ, ТекстПредупреждения)
	
	СтандартныеПодсистемыКлиент.ПередЗавершениемРаботыСистемы(Отказ, ТекстПредупреждения);
	
КонецПроцедуры

#КонецОбласти