
////////////////////////////////////////////////////////////////////////////////
// РегистрСведений.КурсыВалют.ФормаЗаписи
//  
//Параметры формы:
//  стандартные
//  
////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоНовый = Параметры.Ключ.Пустой();
	Элементы.БазоваяВалюта.Доступность = ЭтоНовый;
	Элементы.Валюта.Доступность        = ЭтоНовый;
	
	//Модифицированность = ЭтоНовый;
	Если ЗначениеЗаполнено(Запись.Валюта) И ЗначениеЗаполнено(Запись.Период) Тогда
		
		ТаблицаКурса = РегистрыСведений.КурсыВалют.СрезПоследних(Запись.Период, Новый Структура("Валюта,БазоваяВалюта", Запись.Валюта, Запись.БазоваяВалюта));
		Если ТаблицаКурса.Количество() > 0 Тогда
			Запись.Курс      = ТаблицаКурса[0].Курс;
			Запись.Кратность = ТаблицаКурса[0].Кратность;
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ЭтоНовый Тогда
		АвтоЗаголовок = Ложь;
		Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Курс валюты (%1)'"),
			Запись.Валюта);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Параметры.Ключ.Пустой()
		ИЛИ ТекущийОбъект.Период <> Параметры.Ключ.Период 
		ИЛИ ТекущийОбъект.Валюта <> Параметры.Ключ.Валюта 
		ИЛИ ТекущийОбъект.БазоваяВалюта <> Параметры.Ключ.БазоваяВалюта Тогда
		
		// Проверим уникальность записи
		МенеджерЗаписи = РегистрыСведений.КурсыВалют.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ТекущийОбъект);
		МенеджерЗаписи.Прочитать();
		Если МенеджерЗаписи.Выбран() Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Курс %1/%2 на %3 уже задан. Нельзя создать еще одну такую же запись.'"),
				МенеджерЗаписи.Валюта, МенеджерЗаписи.БазоваяВалюта, Формат(МенеджерЗаписи.Период, "ДЛФ=D"));
			Сообщить(ТекстСообщения);
			Отказ = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ОбновленыКурсыВалют", Запись);
	
КонецПроцедуры



#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы



#КонецОбласти



#Область ОбработчикиКомандФормы



#КонецОбласти


#Область СлужебныеПроцедурыИФункции



#КонецОбласти