#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтчетыСКД.ПриСозданииНаСервере(ЭтотОбъект);
	
	ПодготовитьФормуНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы Тогда 
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда 
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ПриЗакрытииНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТабДокОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	КомпоновкаДанныхКлиент.ОбработкаРасшифровки(ЭтотОбъект, Элемент, Расшифровка, АдресДанныхРасшифровкиОтчет, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Группа2ПриСменеСтраницы(Элемент, ТекущаяСтраница)
	ОбновитьТекущуюСтраницу();
КонецПроцедуры

&НаКлиенте
Процедура ДиаграммаРасходыВыбор(Элемент, ЗначениеДиаграммы, СтандартнаяОбработка)	
	КомпоновкаДанныхКлиент.ДиаграммаВыбор(ЭтотОбъект, Элемент, ЗначениеДиаграммы, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьДиаграмму(Команда)
	ОбновитьТекущуюСтраницу();
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗначенияДиаграммы(Команда)
	ПроверитьЗначенияДиаграммыНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастроитьОформлениеДиаграммы()
	ШрифтПодписей = Новый Шрифт(ШрифтыСтиля.МелкийШрифтТекста);
	
	ДиаграммаРеквизит.ШрифтПодписей = ШрифтПодписей;
	
	ДиаграммаРеквизит.ОбластьПостроения.Шрифт = ШрифтПодписей;
	ДиаграммаРеквизит.ОбластьПостроения.Верх = 0;
	ДиаграммаРеквизит.ОбластьПостроения.Лево = 0;
	ДиаграммаРеквизит.ОбластьПостроения.Низ = 1;
	ДиаграммаРеквизит.ОбластьПостроения.Право = 1;
	
	ДиаграммаРеквизит.ОбластьПостроения.ЦветШкалы = WebЦвета.Черный;
	
	ДиаграммаРеквизит.ФорматЗначенийВПодписях  = "ЧДЦ=2; ЧРГ=.";
КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	КлючОбъекта = Метаданные.Обработки.Отчеты.Имя + ЭтаФорма.ИмяФормы;
	
	ТекУровеньГруппировки = 0;
	
	ОбщиеНастройкиВызовСервера.ЗагрузитьОсновнуюНастройку(ЭтотОбъект);
	
	НастроитьОформлениеДиаграммы();
	
	ОбновитьТекущуюСтраницу();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьТекущуюСтраницу() Экспорт 
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаДиаграммы Тогда
		Если Не ДиаграммаСформирована Тогда 
		КонецЕсли;
	Иначе
		Если Не ОтчетСформирован Тогда 
			ОбновитьСерверСКД();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбновитьСерверСКД()
	
	ТабДок.Очистить();
	
	СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(ЭтотОбъект.АдресСКД);
	
	ОтчетыСКД.ПолучитьДанныеОтчета(СхемаКомпоновкиДанных, ТабДок, Неопределено, УникальныйИдентификатор, Неопределено,
	АдресДанныхРасшифровкиОтчет, Истина, ЭтотОбъект.АдресНастроекСКД);
	
	ОтчетСформирован = Истина;
	
	#Если МобильноеПриложениеСервер Тогда
	#Иначе		
		Элементы.ТабДок.ОтображатьГруппировки = Истина;
	#КонецЕсли
	
КонецПроцедуры

&НаСервере
Процедура ВыбратьНастройкуЗавершениеСервер() Экспорт 
	
	ОбщиеНастройкиВызовСервера.ВыбратьНастройкуЗавершениеСервер(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьЗначенияДиаграммыНаСервере()
	Для Каждого стрТочка из ДиаграммаРеквизит.Точки Цикл
		Для Каждого стрСерия из ДиаграммаРеквизит.Серии Цикл
			значДиаграммы = ДиаграммаРеквизит.ПолучитьЗначение(стрТочка, стрСерия);
			
			Сообщить("" + значДиаграммы.Серия.текст + " " + значДиаграммы.точка.текст + " " + значДиаграммы.Значение);
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПриЗакрытииНаСервере()
	
	ОбщиеНастройкиВызовСервера.СохранитьНастройкуОтчетаПриЗакрытии(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти