Функция ПриНачалеРаботыСистемыПроверитьНеобходимостьЗагрузкиКурсов() Экспорт 
	Если ДеньНедели(ТекущаяДата()) > 5 Тогда 
		Возврат ложь;
	КонецЕсли;
	
	запрос = новый запрос("ВЫБРАТЬ
	|	КурсыВалютСрезПоследних.Валюта
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних КАК КурсыВалютСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ Константа.ВалютаУчета КАК ВалютаУчета
	|		ПО КурсыВалютСрезПоследних.Валюта = ВалютаУчета.Значение
	|ГДЕ
	|	КурсыВалютСрезПоследних.Период < &период
	|	И ВалютаУчета.Значение ЕСТЬ NULL ");
	запрос.УстановитьПараметр("период", НачалоДня(ТекущаяДата()));
	
	рез = запрос.Выполнить();
	
	Возврат не рез.Пустой();
КонецФункции