#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПриНачалеРаботыСистемыПроверитьНеобходимостьЗагрузкиКурсов() Экспорт 
	Если ДеньНедели(ТекущаяДата()) > 5 Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	запрос = Новый запрос("ВЫБРАТЬ
	|	КурсыВалютСрезПоследних.Валюта
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних КАК КурсыВалютСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ Константа.ВалютаУчета КАК ВалютаУчета
	|		ПО КурсыВалютСрезПоследних.Валюта = ВалютаУчета.Значение
	|ГДЕ
	|	КурсыВалютСрезПоследних.Период < &период
	|	И ВалютаУчета.Значение ЕСТЬ NULL ");
	запрос.УстановитьПараметр("период", НачалоДня(ТекущаяДата()));
	
	рез = запрос.Выполнить();
	
	Возврат не рез.Пустой();
КонецФункции

Процедура ЗагрузитьВФоне(Параметры, АдресХранилища) Экспорт 
	
	Результат = РаботаСКурсамиВалют.ЗагрузитьКурсыВалютПоПараметрам(Параметры.Валюты, Параметры.НачалоПериодаЗагрузки, Параметры.ОкончаниеПериодаЗагрузки);
	
	Для Каждого СостояниеЗагрузки Из Результат Цикл
		Если СостояниеЗагрузки.СтатусОперации Тогда
			ЕстьУспешноЗагруженныеКурсы = Истина;
		Иначе
			БезОшибок = Ложь;
			Сообщить(СостояниеЗагрузки.Сообщение);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли