#Область ПрограммныйИнтерфейс

Функция ЗаданиеВыполнено(Знач ИдентификаторЗадания) Экспорт
	
	Возврат ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания);
	
КонецФункции

Процедура ВывестиСообщенияЗадания(ИдентификаторЗадания, ИдентификаторНазначения = Неопределено) Экспорт 
	Задание = ДлительныеОперации.НайтиЗаданиеПоИдентификатору(ИдентификаторЗадания);
	
	Если Задание = Неопределено Тогда
		ТекстКомментария = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Фоновое задание (id=%1) не найдено'"), ИдентификаторЗадания);
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ТекстКомментария;
		Сообщение.Сообщить();
		
		Возврат;
	КонецЕсли;
	Сообщения = Задание.ПолучитьСообщенияПользователю();
	
	Для Каждого Сообщение Из Сообщения Цикл
		Если ИдентификаторНазначения <> Неопределено Тогда 
			Сообщение.ИдентификаторНазначения = ИдентификаторНазначения;
		КонецЕсли;
		
		Сообщение.Сообщить();
	КонецЦикла;
КонецПроцедуры

Функция ОперацииВыполнены(Знач ЗаданияДляПроверки, ЗаданияДляОтмены) Экспорт
	
	Результат = ДлительныеОперации.ОперацииВыполнены(ЗаданияДляПроверки);
	Для каждого ИдентификаторЗадания Из ЗаданияДляОтмены Цикл
		ДлительныеОперации.ОтменитьВыполнениеЗадания(ИдентификаторЗадания);
		Результат.Вставить(ИдентификаторЗадания, Новый Структура("Статус", "Отменено"));
	КонецЦикла;
	Возврат Результат;
	
КонецФункции

#КонецОбласти

