#Область ПрограммныйИнтерфейс

Функция ЗаданиеВыполнено(Знач ИдентификаторЗадания) Экспорт
	
	Возврат ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОперацииВыполнены(Знач ЗаданияДляПроверки, ЗаданияДляОтмены) Экспорт
	
	Результат = ДлительныеОперации.ОперацииВыполнены(ЗаданияДляПроверки);
	Для каждого ИдентификаторЗадания Из ЗаданияДляОтмены Цикл
		ДлительныеОперации.ОтменитьВыполнениеЗадания(ИдентификаторЗадания);
		Результат.Вставить(ИдентификаторЗадания, Новый Структура("Статус", "Отменено"));
	КонецЦикла;
	Возврат Результат;
	
КонецФункции

#КонецОбласти
